
"Quarterly" = "Sabbath School in one place";

"Lesson" = "Weekly lessons";

"Reading" = "Read & Study Sabbath School";

"Verse" = "Bible verses at hand";

"Theme" = "Customizable reading experience";
